# -*- coding: utf-8 -*-
from langchain.output_parsers import StructuredOutputParser, ResponseSchema
from langchain.prompts import PromptTemplate
from langchain.llms import OpenAI
import pandas as pd
from MyOpenAI import myOpenAi

llm = myOpenAi(temperature=1,max_tokens=8000)

# 告诉他我们生成的内容需要哪些字段，每个字段类型式啥
response_schemas = [
    ResponseSchema(type="string", name="A.纤维腺体的组织量", description="纤维腺体的组织量，包含：a类（几乎全部为脂肪）/b类（散在分布的纤维腺体组织）/c类（不均匀分布的纤维腺体组织）/d类（致密纤维腺体组织）"),
    ResponseSchema(type="string", name="B.背景实质强化", description="背景实质强化水平包含：未见/极少/轻度/中度/重度；背景实质强化对称性包含：未见/不对称/对称。"),
    ResponseSchema(type="string", name="C.点状病变", description="未见/可见"),
    ResponseSchema(type="string", name="D.肿块", description="未见/可见；侧别：左/右；象限：外上/外下/内上/内下象限/中央区/乳晕后方/腋尾部；钟面位置：10:00方向；深度：前/中/后三分之一；肿块中心点至乳头后缘距离：CC位？mm，MLO位？mm；形状：卵圆形/圆形/不规则形；边缘：清晰/不清晰（不规则或毛刺状）；信号：T1WI高/低/等/混杂，T2WI高/低/等/混杂，DWI高/低/等，ADC高/低/等；内部强化特征：均匀/不均质/边缘强化/内部暗分隔；大小：？mm×？mm。"),
    ResponseSchema(type="string", name="E.非肿块样强化", description="未见/可见；侧别：左/右；象限：外上/外下/内上/内下象限/中央区/乳晕后方/腋尾部；钟面位置：10:00方向；深度：前/中/后三分之一；肿块中心点至乳头后缘距离：CC位？mm，MLO位？mm；分布：局灶/线样/段样/区域/多发区域/弥漫；信号：T1WI高/低/等/混杂，T2WI高/低/等/混杂，DWI高/低/等，ADC高/低/等；内部强化模式：均匀/不均质/集簇状/成簇环状。"),
    ResponseSchema(type="string", name="F.乳房内淋巴结", description="未见/可见"),
    ResponseSchema(type="string", name="G.皮肤病变", description="未见/可见"),
    ResponseSchema(type="string", name="H.非强化征象", description="T1W平扫高信号/囊肿/术后血肿或血清肿/治疗后皮肤增厚和小梁增厚/不强化的肿块/结构扭曲/假体、定位夹等导致的信号缺失。"),
    ResponseSchema(type="string", name="I.相关征象", description="未见/可见：乳头回缩/乳头受侵/皮肤回缩/皮肤增厚/皮肤受侵（直接侵犯或炎性乳癌）/腋窝淋巴结肿大/胸大肌受侵/胸壁受侵/结构扭曲。"),
    ResponseSchema(type="string", name="J.含脂肪病变", description="未见/可见：脂肪坏死/错构瘤/术后含脂肪的血清或血清肿。"),
    ResponseSchema(type="string", name="K.动态增强曲线评估", description="早期：缓慢/中等/快速；延迟期：渐进型/平台型/流出型。"),
    ResponseSchema(type="string", name="L.假体", description="未见/可见；假体材料和腔型：盐水/硅胶/其它植入材料/腔型；完整度：完整/破裂；假体位置：腺体后/胸肌后；假体外形异常：局部膨出；硅胶假体囊内异常：放射状皱褶/包膜下线/锁眼征/意面征；囊外硅胶：乳腺内/淋巴结内；水滴：未见/可见；假体周围液体：未见/可见。"),
]

# 初始化解析器
output_parser = StructuredOutputParser.from_response_schemas(response_schemas)

# 生成的格式提示符
format_instructions = output_parser.get_format_instructions()
# print(format_instructions)

template = """
给定下面的文本，理解并学习类别信息，以结构化数据格式返回，将输入文本的内容全部抽取到类别中，一样的文字只能出现在一个类别中.

{format_instructions}

% USER INPUT:
{user_input}

YOUR RESPONSE:
"""

# prompt
prompt = PromptTemplate(
    input_variables=["user_input"],
    partial_variables={"format_instructions": format_instructions},
    template=template
)
import re
# 构造5-shot的prompt示例
promptValue = """

输出应该是按以下模式格式化的标记代码片段，包括开头和结尾的" ' ' ' json"和" ' ' ' ":
{partial_variables}
现提供5个示例文本和问题对，
示例 1:
输入：
双侧乳腺呈中量腺体型，腺体呈小斑片状，右侧乳腺腺体信号较均匀，增强后未见异常强化灶，左侧乳腺外上象限见一小片状异常信号影，边缘不规则，大小约19.7mm×13.3mm，边缘小毛刺，病灶T2WI压脂相呈稍高信号，T1WI压脂相等信号，增强后病灶较明显强化，动态增强早期明显迅速强化，动态增强曲线呈上升平台型。双乳皮肤未见增厚，乳头未见内陷。双腋下未见肿大淋巴结显示。
右乳未见明确异常。
输出：
```json
{{
    "A.纤维腺体的组织量": "中量腺体型",
    "B.背景实质强化水平": "未见",
    "C.点状病变": "未见",
    "D.肿块": "左乳外上象限；大小：19.7mm×13.3mm；边缘：不规则（小毛刺）；信号：T2WI稍高，T1WI等；内部强化特征：明显强化",
    "E.非肿块样强化": "未见",
    "F.乳房内淋巴结": "未见",
    "G.皮肤病变": "未见增厚",
    "H.非强化征象": "未见",
    "I.相关征象": "乳头未见内陷",
    "J.含脂肪病变": "未见",
    "K.动态增强曲线评估": "早期：迅速；延迟期：平台型",
    "L.假体": "未见"
}}
```
示例2：
输入：
“双侧乳腺假体植入术后，外院左乳肿物切除术后4天”复查，双乳大小、形态对称，双侧乳腺腺体与胸大肌之间见假体组织影，T1WI呈等信号，STIR上呈明显高信号，其囊壁完整。左乳腺外上象限内见不规则小片状异常信号灶，范围约2.5×1.5cm，边界不清，边缘毛糙，T2呈等稍高混杂信号，增强明显强化，动态增强曲线呈速升平台型；其下方腺体内见一类圆形T2低、T1低信号，边界清，大小约1.1×1.1cm，增强未见强化。右侧乳晕周围见散在多发小结节状异常信号灶，边界尚清，T2呈高信号，直径约0.6cm不等，增强明显强化，动态曲线呈速升速降型。双乳皮肤未见增厚，乳头未见凹陷。双侧胸大肌未见异常信号。冠状位示：双侧腋窝可见散在多个小淋巴结，最短径约0.3cm。
输出：
```json
{{
    "A.纤维腺体的组织量": ““双侧乳腺假体植入术后，外院左乳肿物切除术后4天”复查，双乳大小、形态对称",
    "B.背景实质强化水平": "未提及",
    "C.点状病变": "右侧乳晕周围见散在多发小结节状异常信号灶，边界尚清，T2呈高信号，直径约0.6cm不等，增强明显强化，动态曲线呈速升速降型。",
    "D.肿块": "左乳腺外上象限内见不规则小片状异常信号灶，范围约2.5×1.5cm，边界不清，边缘毛糙，T2呈等稍高混杂信号，增强明显强化，动态增强曲线呈速升平台型；其下方腺体内见一类圆形T2低、T1低信号，边界清，大小约1.1×1.1cm，增强未见强化。",
    "E.非肿块样强化": "未见",
    "F.乳房内淋巴结": "未见",
    "G.皮肤病变": "未见",
    "H.非强化征象": "未见",
    "I.相关征象": "双乳皮肤未见增厚，乳头未见凹陷。双侧胸大肌未见异常信号。冠状位示：双侧腋窝可见散在多个小淋巴结，最短径约0.3cm。",
    "J.含脂肪病变": "未见",
    "K.动态增强曲线评估": "速升平台型",
    "L.假体": "双侧乳腺腺体与胸大肌之间见假体组织影，T1WI呈等信号，STIR上呈明显高信号，其囊壁完整"
}}
```
示例3：
输入：
双乳呈中量腺体型，腺体呈班片状，腺体信号欠均匀。右乳外上象限见一异常信号结节影，结节略呈分叶状，边缘见毛刺，T1WI压脂相呈等信号，T2WI压脂相呈高信号，增强后呈较明显不均匀性强化，中心见小片状低信号，动态增强曲线呈速升平台型，结节最大层面大小约32mm×25mm。左乳外下象限见一结节状异常信号，大小约为12mm×11mm，T1W压脂呈稍低信号，T2W呈稍高信号，增强扫描环形强化，边缘似可见少许毛刺，双乳腺见多个圆形、小片状异常信号影，T2WI呈高信号，T1WI压脂呈稍高/低信号，增强后未见明显强化。双侧乳头未见内陷，皮肤未见增厚。右侧腋下见多个肿大淋巴结影，较大一个大小约为18mm×15mm，不均匀强化，周围脂肪间隙稍模糊，动态增强曲线呈速升平台型。
输出：
```json
{{
    "A.纤维腺体的组织量": "双乳呈中量腺体型",
    "B.背景实质强化水平": "腺体呈班片状，腺体信号欠均匀",
    "C.点状病变": "未见",
    "D.肿块": "1)右乳外上象限见一异常信号结节影，结节略呈分叶状，边缘见毛刺，T1WI压脂相呈等信号，T2WI压脂相呈高信号，增强后呈较明显不均匀性强化，中心见小片状低信号，结节最大层面大小约32mm×25mm。
         2)左乳外下象限见一结节状异常信号，大小约为12mm×11mm，T1W压脂呈稍低信号，T2W呈稍高信号，增强扫描环形强化，边缘似可见少许毛刺，双乳腺见多个圆形、小片状异常信号影，T2WI呈高信号，T1WI压脂呈稍高/低信号，增强后未见明显强化",
    "E.非肿块样强化": "未见",
    "F.乳房内淋巴结": "右腋下：多个肿大淋巴结，较大者18mm×15mm，不均匀强化",
    "G.皮肤病变": "未见",
    "H.非强化征象": "未见",
    "I.相关征象": "双侧乳头未见内陷，皮肤未见增厚。右侧腋下见多个肿大淋巴结影，较大一个大小约为18mm×15mm，不均匀强化，周围脂肪间隙稍模糊，动态增强曲线呈速升平台型",
    "J.含脂肪病变": "未见",
    "K.动态增强曲线评估": "呈速升平台型",
    "L.假体": "未见"
}}
```
示例4：
输入：
双侧乳腺由散在纤维腺体组织构成，右侧乳腺内上象限见卵圆形肿块，边界尚清，大小约11.0mm×10.0mm，边缘不规则，于T2WI上呈稍高信号，T1WI上呈等信号，DWI上病灶弥散受限，增强后，病灶肿块呈明显不均匀强化，动态增强早期强化明显，增强像时间信号曲线呈速升平台型。病灶后缘紧贴右侧胸大肌。另双侧乳腺内见数个小结节影，边界清晰，T1WI上呈等信号，T2WI上呈稍高信号，增强扫描，病灶明显均匀强化。左侧乳房乳后间隙清晰，左侧胸大肌未见异常信号影；双侧Cooper’s韧带未见增厚，皮肤未见增厚，双侧乳头未见凹陷；双侧腋窝未见肿大淋巴结。
输出：
```json
{{
    "A.纤维腺体的组织量": "双侧乳腺由散在纤维腺体组织构成",
    "B.背景实质强化水平": "未提及",
    "C.点状病变": "未见",
    "D.肿块": "右侧乳腺内上象限见卵圆形肿块，边界尚清，大小约11.0mm×10.0mm，边缘不规则，于T2WI上呈稍高信号，T1WI上呈等信号，DWI上病灶弥散受限，增强后，病灶肿块呈明显不均匀强化，动态增强早期强化明显，增强像时间信号曲线呈速升平台型，病灶后缘紧贴右侧胸大肌",
    "E.非肿块样强化": "未见",
    "F.乳房内淋巴结": "另双侧乳腺内见数个小结节影，边界清晰，T1WI上呈等信号，T2WI上呈稍高信号，增强扫描，病灶明显均匀强化",
    "G.皮肤病变": "未见",
    "H.非强化征象": "未见",
    "I.相关征象": "左侧乳房乳后间隙清晰，左侧胸大肌未见异常信号影；双侧Cooper’s韧带未见增厚，皮肤未见增厚，双侧乳头未见凹陷；双侧腋窝未见肿大淋巴结",
    "J.含脂肪病变": "未见",
    "K.动态增强曲线评估": "呈速升平台型",
    "L.假体": "未见"
}}
```
示例5：
输入：
“右乳癌术后”复查，右乳缺如，增强扫描右乳及右侧腋窝术区局部未见明确异常强化肿块影。左乳外上象限可见一大小约0.9cm×0.7cm结节灶，T2W呈稍高信号，DWI可见弥散受限，增强扫描可见明显强化，呈速升平台型；余左乳内未见明确异常强化肿块病灶。
输出：
```json
{{
    "A.纤维腺体的组织量": "“右乳癌术后”复查，右乳缺如",
    "B.背景实质强化水平": "未见",
    "C.点状病变": "未见",
    "D.肿块": "左乳外上象限可见一大小约0.9cm×0.7cm结节灶，T2W呈稍高信号，DWI可见弥散受限，增强扫描可见明显强化，余左乳内未见明确异常强化肿块病灶",
    "E.非肿块样强化": "增强扫描右乳及右侧腋窝术区局部未见明确异常强化肿块影",
    "F.乳房内淋巴结": "未见",
    "G.皮肤病变": "未见",
    "H.非强化征象": "未见",
    "I.相关征象": "未见",
    "J.含脂肪病变": "未见",
    "K.动态增强曲线评估": "左乳：呈速升平台型",
    "L.假体": "未见"
}}
```
输入：
{user_input}
输出：
"""

# 从.xls文件中读取输入内容
dataframe = pd.read_excel("./data/data.xls", header=None)
user_inputs = dataframe.iloc[:, 0].tolist()
n=len(user_inputs)
for i,user_input in enumerate(user_inputs):
    print(f"{i}/{n} begin")
    promptValue = prompt.format(user_input=user_input)
    print(promptValue)
    llm_output = llm.predict(promptValue)
    print("llm_output:\t"+llm_output)
    try:
        print("使用解析器进行解析生成的内容：\t"+str(output_parser.parse(llm_output)))
    except Exception as e:
        print("Exception :\t"+str(e))
    print(f"{i}/{n} end")
    break
